// main.cpp : Defines the entry point for the console application.
//

//-------------------------------------------------------------
// Include File
//-------------------------------------------------------------
#include <stdio.h>
#include <string>
#include <vector>
#include <iostream>

//-------------------------------------------------------------
// using namespase
//-------------------------------------------------------------
using namespace std;

//-------------------------------------------------------------
// Static Variable
//-------------------------------------------------------------

/* nothing */

//-------------------------------------------------------------
// Static Prototype Func
//-------------------------------------------------------------

/* nothing */

//-------------------------------------------------------------
// Global Func
//-------------------------------------------------------------

#pragma region GLOBAL_FUNC

/*!
*************************************************************
* @brief main関数
* @param[in]	argc:
* @param[in]	*argv[]:
* @return
* @exception
* @detail
*************************************************************/
int main(int argc, char *argv[])
{
	cout << "Hello Ci Test!" << endl;
	
	system("pause");
	return 0;
}

#pragma endregion GLOBAL_FUNC  


//-------------------------------------------------------------
// Static Func
//-------------------------------------------------------------

#pragma region STATIC_FUNC

#pragma endregion STATIC_FUNC
